       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-IMC.
       ENVIRONMENT DIVISION.
           CONFIGURATION SECTION.
               SPECIAL-NAMES.
                   DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       77 WS-PESO          PIC 99 VALUE ZEROES.
       77 WS-ALTURA        PIC 9V999 VALUE ZEROES.

       77 WS-IMC           PIC 99V99 VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            INITIALISE WS-PESO WS-ALTURA WS-IMC
            DISPLAY "INSIRA SUA ALTURA (EM METROS):"
            ACCEPT WS-ALTURA

            DISPLAY "INSIRA SEU PESO (EM KG)"
            ACCEPT WS-PESO

            MULTIPLY WS-ALTURA BY WS-ALTURA
            DIVIDE WS-ALTURA INTO WS-PESO GIVING WS-IMC

            DISPLAY "IMC = " WS-IMC

            EVALUATE WS-IMC
               WHEN LESS THAN 18,5
                   DISPLAY "DESNUTRIDO"
               WHEN GREATER THAN 18,5 AND LESS THAN 25
                   DISPLAY "ADEQUADO"
               WHEN GREATER OR EQUAL TO 25 AND LESS THAN 30
                   DISPLAY "PRE-OBESO"
               WHEN GREATER OR EQUAL TO 30 AND LESS THAN 35
                   DISPLAY "OBESIDADE GRAU 1"
               WHEN GREATER OR EQUAL TO 35
                   DISPLAY "OBESIDADE GRAU 2"
            END-EVALUATE

            STOP RUN.
       END PROGRAM CALC-IMC.
