
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG_AULA04.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 WS-VALORES.
               05 WS-VALOR01           PIC S9(6)V99 VALUE ZEROES.
               05 WS-VALOR02           PIC S9(6)V99 VALUE ZEROES.
               05 WS-RESULTADO         PIC S9(6)V99 VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            INITIALISE WS-VALORES
            MOVE 5 TO WS-VALOR01
            MOVE 10 TO WS-VALOR02
            ADD WS-VALOR01 WS-VALOR02 GIVING WS-RESULTADO

            DISPLAY "RESULTADO: " WS-RESULTADO

            ADD 10 TO WS-RESULTADO
            DISPLAY "RESULTADO APOS ADD TO: " WS-RESULTADO

            SUBTRACT 10 FROM WS-RESULTADO
            DISPLAY "RESULTADO APOS SUBTRACT 10: " WS-RESULTADO

            DIVIDE WS-VALOR01 INTO WS-RESULTADO
            DISPLAY "RESULTADO APOS DIVIDE INTO 5: " WS-RESULTADO

            MULTIPLY WS-VALOR01 BY WS-RESULTADO
            DISPLAY "RESULTADO APOS MULTIPLY BY 5: " WS-RESULTADO

            STOP RUN.
       END PROGRAM PROG_AULA04.
